
&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", 
		ЭтотОбъект), , , Истина , УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресКартинки = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ДанныеФайлаКартинки");
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", 
		ЭтотОбъект), , , Истина , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, АдресВХранилище, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		Файл = Новый Файл(ВыбранноеИмяФайла);
		//Объект.ИмяФайла = Файл.Имя;
		АдресКартинки = АдресВХранилище;
		ПоместитьФайлКартинки();
	КонецЕсли;
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеФайлаКартинки");

КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлКартинки()

	ЭлементСправочника = РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
	ЭлементСправочника.ДанныеФайлаКартинки = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
	ЭлементСправочника.Записать();
	УдалитьИзВременногоХранилища(АдресКартинки);

	ЗначениеВРеквизитФормы(ЭлементСправочника, "Объект");
КонецПроцедуры