
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
	Если Параметры.Свойство("Место") Тогда
		Объект.Место = Параметры.Место;
	КонецЕсли;
	
	Если Параметры.Свойство("Ряд") Тогда
		Объект.Ряд = Параметры.Ряд;
	КонецЕсли;
	
	Если Параметры.Свойство("Территория") Тогда 
		Объект.Территория = Параметры.Территория;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Территория) Тогда
		Объект.Территория = Объект.Площадка.Владелец;
	КонецЕсли;
	
	Если Параметры.Свойство("НачальныйПериод") Тогда 
		Объект.Дата = Параметры.НачальныйПериод;
	Иначе
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	//Дата = ТекущаяДатаСеанса();

КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	
	Если Объект.Место.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоМестуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМестуНаСервере()
	
	МестоОбъект = Объект.Место.ПолучитьОбъект();
	
	Объект.Площадка = МестоОбъект.Площадка;
	Объект.Ряд = Объект.Место.Владелец;
	
	Если Не Объект.Площадка.Пустая() Тогда
		
		ПлощадкаОбъект = Объект.Площадка.ПолучитьОбъект();
		
		Если Не ПлощадкаОбъект.Владелец.Пустая() Тогда
			Объект.Территория = ПлощадкаОбъект.Владелец;
			
			ТерриторияОбъект = ПлощадкаОбъект.Владелец.ПолучитьОбъект();
			
			Если Не ТерриторияОбъект.Владелец.Пустая() Тогда
				Объект.Организация = ТерриторияОбъект.Владелец;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТранспортноеСредство, "Контрагент");
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Объект.ТранспортноеСредство = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ТранспортноеСредство");
	
КонецПроцедуры