#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВзаимоРасчётыСКлиентами.Записывать = Истина;
	Движение = Движения.ВзаимоРасчётыСКлиентами.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыездСПарковки") Тогда
		
		Организация = ДанныеЗаполнения.Организация;
		Территория = ДанныеЗаполнения.Территория;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Сумма = ДанныеЗаполнения.Сумма;
		
		СтрокаУслуги = Услуги.Добавить();
		СтрокаУслуги.Услуга = ДанныеЗаполнения.Услуга;
		СтрокаУслуги.Объект = ДанныеЗаполнения.Площадка;
		СтрокаУслуги.Количество = ДанныеЗаполнения.Количество;
		СтрокаУслуги.Цена = ДанныеЗаполнения.Цена;
		СтрокаУслуги.Сумма = ДанныеЗаполнения.Сумма;
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли