#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает цену услуги
Функция ЦенаУслуги(Площадка, Услуга = Неопределено, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос(?(ЗначениеЗаполнено(Услуга), ТекстЗапросаЦенаУслуги(), ТекстЗапросаЦенаУслугиПлощадка()));
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("Услуга", Услуга);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Услуга = Выборка.Услуга;
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЦенаУслуги()
	
	Возврат "
	|ВЫБРАТЬ
	|	ЦеныУслугСрезПоследних.Цена КАК Цена,
	|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Период, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних";
	
КонецФункции

Функция ТекстЗапросаЦенаУслугиПлощадка()
	
	Возврат "
	|ВЫБРАТЬ
	|	ЦеныУслугСрезПоследних.Цена КАК Цена,
	|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Период, Площадка = &Площадка) КАК ЦеныУслугСрезПоследних";
	
КонецФункции

#КонецОбласти

#КонецЕсли