#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает цену услуги
Функция ЦенаУслуги(Услуга, Объект, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаЦенаУслуги());
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Площадка", Объект);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЦенаУслуги()
	
	Возврат "
	|ВЫБРАТЬ
	|	ЦеныУслугСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Период, Площадка = &Площадка
	|	И Услуга = &Услуга) КАК ЦеныУслугСрезПоследних";
	
КонецФункции

#КонецОбласти

#КонецЕсли