Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВзаимоРасчётСКлиентами.Записывать = Истина;
	Движение = Движения.ВзаимоРасчётСКлиентами.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Сумма = ДанныеЗаполнения.Сумма;
	
КонецПроцедуры
