&НаКлиенте
Процедура ПечатьЧек(Команда)
	ТабДок = СформироватьПечатнуюФормуНаСервере();
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Акт выполненных работ №" + Объект.Номер);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ДокументОбъект.ПолучитьМакет("Чек");
	Если Макет = Неопределено Тогда
		Сообщить("Макет печатной формы не найден!");
		Возврат Неопределено;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Номер = ДокументОбъект.Номер;
	ОбластьШапка.Параметры.Дата = ДокументОбъект.Дата;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьОсновные = Макет.ПолучитьОбласть("ОсновныеДанные");
	ОбластьОсновные.Параметры.Организация = ДокументОбъект.Организация;
	ТабДок.Вывести(ОбластьОсновные);
	
	ОбластьСумма = Макет.ПолучитьОбласть("Сумма");
	ТабДок.Вывести(ОбластьСумма);
	
	ОбластьШапкаЗаказчик = Макет.ПолучитьОбласть("ШапкаЗаказчик");
	ТабДок.Вывести(ОбластьШапкаЗаказчик);
	
	ОбластьЛица = Макет.ПолучитьОбласть("Лица");
	ОбластьЛица.Параметры.Организация = ДокументОбъект.Организация;
	ОбластьЛица.Параметры.Ответственный = ДокументОбъект.Организация.Ответственный;
	ТабДок.Вывести(ОбластьЛица);
	
	Возврат ТабДок;
КонецФункции

