#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ЦеныУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги из Услуги Цикл
		
		Движение = Движения.ЦеныУслуг.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Организация = Организация;
		Движение.Территория = Территория;
		Движение.Площадка = ТекСтрокаУслуги.Объект;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.Цена = ТекСтрокаУслуги.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли