&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
	Если Параметры.Свойство("Место") Тогда
		Объект.Место = Параметры.Место;
	КонецЕсли;
	
	Если Параметры.Свойство("Ряд") Тогда
		Объект.Ряд = Параметры.Ряд;
	КонецЕсли;
	
	Дата = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	
	Если Объект.Место.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоМестуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМестуНаСервере()
	
	МестоОбъект = Объект.Место.ПолучитьОбъект();
	
	Объект.Площадка = МестоОбъект.Площадка;
	Объект.Ряд = Объект.Место.Владелец;
	
	Если Не Объект.Площадка.Пустая() Тогда
		
		ПлощадкаОбъект = Объект.Площадка.ПолучитьОбъект();
		
		Если Не ПлощадкаОбъект.Владелец.Пустая() Тогда
			Объект.Территория = ПлощадкаОбъект.Владелец;
			
			ТерриторияОбъект = ПлощадкаОбъект.Владелец.ПолучитьОбъект();
			
			Если Не ТерриторияОбъект.Владелец.Пустая() Тогда
				Объект.Организация = ТерриторияОбъект.Владелец;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
