
&НаКлиенте
Процедура Оплатить(Команда)
	ОплатитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТранспортноеСредство, "Контрагент");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
	Если Параметры.Свойство("Место") Тогда
		Объект.Место = Параметры.Место;
		Результат = РегистрыНакопления.ЗанятостьМест.ИнформацияОМесте(Параметры.Место);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Объект, Результат, "Услуга,Количество,Цена,Сумма");
		Задолженность = Параметры.Сумма;
		//Задолженность = РегистрыНакопления.ВзаимоРасчётыСКлиентами.ЗадолженностьКонтрагента(Объект.Контрагент);
	КонецЕсли;
	
	Если Параметры.Свойство("Ряд") Тогда
		Объект.Ряд = Параметры.Ряд;
	КонецЕсли;
	
	Если Параметры.Свойство("ТранспортноеСредство") Тогда 
		Объект.ТранспортноеСредство = Параметры.ТранспортноеСредство;
		Объект.Контрагент = Параметры.ТранспортноеСредство.Контрагент;
	КонецЕсли;
	
	Если Параметры.Свойство("Территория") Тогда 
		Объект.Территория = Параметры.Территория;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Территория) Тогда
		Объект.Территория = Объект.Площадка.Владелец;
	КонецЕсли;
	
	Если Параметры.Свойство("НачальныйПериод") Тогда 
		Объект.Дата = Параметры.НачальныйПериод;
	Иначе
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	
	Если Объект.Место.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоМестуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМестуНаСервере()
	
	МестоОбъект = Объект.Место.ПолучитьОбъект();
	
	Объект.Площадка = МестоОбъект.Площадка;
	Объект.Ряд = Объект.Место.Владелец;
	
	Если Не Объект.Площадка.Пустая() Тогда
		
		ПлощадкаОбъект = Объект.Площадка.ПолучитьОбъект();
		
		Если Не ПлощадкаОбъект.Владелец.Пустая() Тогда
			Объект.Территория = ПлощадкаОбъект.Владелец;
			
			ТерриторияОбъект = ПлощадкаОбъект.Владелец.ПолучитьОбъект();
			
			Если Не ТерриторияОбъект.Владелец.Пустая() Тогда
				Объект.Организация = ТерриторияОбъект.Владелец;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОплатитьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка
		
		ДокументРеализация = Документы.РеализацияТовараИУслуг.СоздатьДокумент();
		ДокументРеализация.Дата = ТекущаяДатаСеанса();
		ДокументРеализация.Заполнить(Объект.Ссылка);
		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
		ДокументОплата = Документы.Оплата.СоздатьДокумент();
		ДокументОплата.Дата = ТекущаяДатаСеанса();
		ДокументОплата.Заполнить(ДокументРеализация.Ссылка);
		ДокументОплата.Записать(РежимЗаписиДокумента.Проведение);

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Задолженность = РегистрыНакопления.ВзаимоРасчётыСКлиентами.ЗадолженностьКонтрагента(Объект.Контрагент);
	
КонецПроцедуры