
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если РегистрыНакопления.ЗанятостьМест.ТранспортноеСредствоНаПолощадке(ТранспортноеСредство) Тогда
		ОбщегоНазначения.СообщитьПользователю("Транспортное средство уже на площадке!",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// регистр ЗанятостьМест Приход
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения          = ВидДвиженияНакопления.Приход;
	Движение.Период               = Дата;
	Движение.Организация          = Организация;
	Движение.Территория           = Территория;
	Движение.Площадка             = Площадка;
	Движение.Ряд                  = Ряд;
	Движение.Место                = Место;
	Движение.Состояние            = 1;
	Движение.Контрагент           = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Место") Тогда
			Место = ДанныеЗаполнения.Место;
		КонецЕсли;
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	
КонецПроцедуры
