
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗанятостьМест Приход
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Площадка = Площадка;
	Движение.Место = Место;
	Движение.Контрагент = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Место") Тогда
			Место = ДанныеЗаполнения.Место;		
		КонецЕсли;
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	
КонецПроцедуры
