
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗанятостьМест Приход
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Территория = Территория;
	Движение.Площадка = ПарковочнаяПлощадка;
	Движение.Место = Место;
	Движение.Контрагент = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	
КонецПроцедуры
