
Функция ЗадолженностьКонтрагента(Контрагент, Период = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВзаимоРасчётыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаимоРасчётыСКлиентами.Остатки(&Период,) КАК ВзаимоРасчётыСКлиентамиОстатки
	|ГДЕ
	|	ВзаимоРасчётыСКлиентамиОстатки.Контрагент = &Контрагент");
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
