Процедура ДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|   Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|   Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователя";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователя", 
		ТекущийПользовательИБ.УникальныйИдентификатор);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Источник.Ответственный = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры