&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Площадка") Тогда
		Объект.Площадка = Параметры.Площадка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Построить(Команда)
	
	Если Объект.Площадка.Пустая() Тогда
		Предупреждение("Не указана площадка!");
		Возврат;
	КонецЕсли;
	
	Если КоличествоРядов <= 0 Тогда
		Предупреждение("Укажите количество рядов!");
		Возврат;
	КонецЕсли;
	
	Если КоличествоМест <= 0 Тогда
		Предупреждение("Укажите количество мест!");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НаименованиеРяда) Тогда
		Предупреждение("Укажите наименование ряда!");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(НаименованиеМеста) Тогда
		Предупреждение("Укажите наименование места!");
		Возврат;
	КонецЕсли;
	
	Попытка
		СоздатьРядыИМестаНаСервере();
		Предупреждение("Готово!");
		Закрыть();
	Исключение
		Предупреждение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРядыИМестаНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   Ряды.Ссылка
		|ИЗ
		|   Справочник.Ряды КАК Ряды
		|ГДЕ
		|   Ряды.Владелец = &Площадка";
	Запрос.УстановитьПараметр("Площадка", Объект.Площадка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ВызватьИсключение("Для площадки """ + Объект.Площадка.Наименование + """ уже созданы ряды и места. Повторное создание невозможно.");
	КонецЕсли;
	
	Территория = Неопределено;
	Если Не Объект.Площадка.Пустая() Тогда
		ПлощадкаОбъект = Объект.Площадка.ПолучитьОбъект();
		Территория = ПлощадкаОбъект.Владелец;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Для НомерРяда = 1 По КоличествоРядов Цикл
			
			РядОбъект = Справочники.Ряды.СоздатьЭлемент();
			РядОбъект.Наименование = НаименованиеРяда + " " + Формат(НомерРяда, "ЧГ=0");
			РядОбъект.Владелец = Объект.Площадка;
			РядОбъект.Территория = Территория;
			РядОбъект.Записать();
			
			РядСсылка = РядОбъект.Ссылка;
			
			Для НомерМеста = 1 По КоличествоМест Цикл
				
				МестоОбъект = Справочники.Места.СоздатьЭлемент();
				МестоОбъект.Наименование = НаименованиеМеста + " " + Формат(НомерМеста, "ЧГ=0");
				МестоОбъект.Владелец = РядСсылка;
				МестоОбъект.Площадка = Объект.Площадка;
				МестоОбъект.Записать();
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение("Ошибка при создании: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры