
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗанятостьМест Расход
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Площадка = Площадка;
	Движение.Место = Место;
	Движение.Контрагент = Контрагент;
	Движение.ТранспортноеСредство = Авто;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
