
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗанятостьМест.Записывать = Истина;
	Движение = Движения.ЗанятостьМест.Добавить();
	Движение.ВидДвижения          = ВидДвиженияНакопления.Расход;
	Движение.Период               = Дата;
	Движение.Организация          = Организация;
	Движение.Территория           = Территория;
	Движение.Площадка             = Площадка;
	Движение.Ряд                  = Ряд;
	Движение.Место                = Место;
	Движение.Состояние            = 0;
	Движение.Контрагент           = Контрагент;
	Движение.ТранспортноеСредство = ТранспортноеСредство;
	
КонецПроцедуры
