
Функция ИнформацияОМесте(Место) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Территория");
	Результат.Вставить("Площадка");
	Результат.Вставить("Ряд");
	Результат.Вставить("Место", Место);
	Результат.Вставить("ТранспортноеСредство");
	Результат.Вставить("Состояние", Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗанятостьМест.Площадка КАК Площадка,
	|	ЗанятостьМест.Ряд КАК Ряд,
	|	ЗанятостьМест.Место КАК Место,
	|	ЗанятостьМест.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗанятостьМест.Состояние = 0 КАК Состояние,
	|	ЗанятостьМест.Территория КАК Территория
	|ИЗ
	|	РегистрНакопления.ЗанятостьМест КАК ЗанятостьМест
	|ГДЕ
	|	ЗанятостьМест.Место = &Место");
	
	Запрос.УстановитьПараметр("Место", Место);
		Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции