
Функция ИнформацияОМесте(Место) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("Территория");
	Результат.Вставить("Площадка");
	Результат.Вставить("Ряд");
	Результат.Вставить("Место", Место);
	Результат.Вставить("ТранспортноеСредство");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Состояние" , Истина);
	Результат.Вставить("НачальныйПериод");
	Результат.Вставить("Количество", 0);
	Результат.Вставить("Цена"      , 0);
	Результат.Вставить("Сумма"     , 0);
	Результат.Вставить("Услуга"    );
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗанятостьМест.Площадка КАК Площадка,
	|	ЗанятостьМест.Ряд КАК Ряд,
	|	ЗанятостьМест.Место КАК Место,
	|	ЗанятостьМест.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗанятостьМест.Состояние = 0 КАК Состояние,
	|	ЗанятостьМест.Территория КАК Территория,
	|	ЗанятостьМест.Период КАК Период,
	|	ЗанятостьМест.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрНакопления.ЗанятостьМест КАК ЗанятостьМест
	|ГДЕ
	|	ЗанятостьМест.Место = &Место
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Место", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Не Выборка.Состояние Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		//Результат.Количество = "( " + (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(Выборка.Период)) / (60 * 60 * 24) + 1 + " дней )";
		Результат.Количество = (НачалоДня(ТекущаяДатаСеанса()) - НачалоДня(Выборка.Период)) / (60 * 60 * 24) + 1;
		Результат.НачальныйПериод = Выборка.Период;
		Результат.Цена = РегистрыСведений.ЦеныУслуг.ЦенаУслуги(Результат.Площадка, Результат.Услуга, Результат.НачальныйПериод);
		Результат.Сумма = Результат.Цена * Результат.Количество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТранспортноеСредствоНаПолощадке(ТранспортноеСредство) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗанятостьМест.Состояние = 0 КАК Занято
	|ИЗ
	|	РегистрНакопления.ЗанятостьМест КАК ЗанятостьМест
	|ГДЕ
	|	ЗанятостьМест.ТранспортноеСредство = &ТранспортноеСредство
	|УПОРЯДОЧИТЬ ПО
	|	ЗанятостьМест.Период УБЫВ");
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Занято;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции