#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Инициализация при создании формы
	ОбновитьТаблицуМестНаСервер();
	ДобавитьЭлементы();

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТаблицуМест(Команда)
	ОбновитьТаблицуМестНаСервер();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьМеста()
	
	ДобавитьЭлементы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуМестНаСервер()
	
	//Копировал из функции ВыборМест
	
	ТаблицаМест.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Места.Ссылка КАК Место,
	|	Места.Наименование КАК НаименованиеМеста,
	|	Ряда.Ссылка КАК Ряд,
	|	Ряда.Наименование КАК НаименованиеРяда,
	|	Площадка1.Ссылка КАК Площадка,
	|	Площадка1.Наименование КАК НаименованиеПлощадки,
	|	ВЫБОР
	|		КОГДА ЗанятостьМестОстатки.СостояниеОстаток > 0
	|			ТОГДА 1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Свободно,
	|	ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка) КАК ТранспортноеСредство
	|ИЗ
	|	Справочник.Площадки КАК Площадка1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ряды КАК Ряда
	|		ПО Площадка1.Ссылка = Ряда.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Места КАК Места
	|		ПО Ряда.Ссылка = Места.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятостьМест.Остатки КАК ЗанятостьМестОстатки
	|		ПО ЗанятостьМестОстатки.Площадка = Площадка1.Ссылка
	|		И ЗанятостьМестОстатки.Территория = Площадка1.Владелец
	|		И ЗанятостьМестОстатки.Место = Места.Владелец
	|ГДЕ
	|	НЕ Ряда.ПометкаУдаления
	|	И НЕ Места.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Площадка,
	|	Ряд,
	|	Место";
	
	ТаблицаМест.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()
	
	ГруппаСетка = Элементы.Добавить("ГруппаСетка", Тип("ГруппаФормы"), Элементы.ГруппаМониторПарковки);
	ГруппаСетка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСетка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ТабПлощадки = ЭтотОбъект.ТаблицаМест.Выгрузить(, "Площадка");
	ТабПлощадки.Свернуть("Площадка");
	Для каждого СтрокаПлощадки Из ТабПлощадки Цикл
		Площадка = СтрокаПлощадки.Площадка;
		
		ПлощадкаИД = Строка(Площадка.УникальныйИдентификатор());
		ПлощадкаИД = СтрЗаменить(ПлощадкаИД, "-", "_");
		ИмяГруппыПлощадка = "ИмяГруппыПлощадка__" + ПлощадкаИД;
		ГруппаПлощадка = Элементы.Добавить(ИмяГруппыПлощадка, Тип("ГруппаФормы"), ГруппаСетка);
		ГруппаПлощадка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПлощадка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПлощадка.Заголовок = "Площадка: " + Площадка.Наименование;
		
		ПлощадкаОтбор = Новый Структура("Площадка", Площадка);
		ТабРяды = ЭтотОбъект.ТаблицаМест.Выгрузить().Скопировать(ПлощадкаОтбор);
		ТабРяды.Свернуть("Ряд");
		Для каждого СтрокаРяд Из ТабРяды Цикл 
			Ряд = СтрокаРяд.Ряд;
			
			РядИД = Строка(Ряд.УникальныйИдентификатор());
			РядИД = СтрЗаменить(РядИД, "-", "_");
			ИмяГруппыРяд = "ИмяГруппыРяд__" + РядИД;
			ГруппаРяд = Элементы.Добавить(ИмяГруппыРяд, Тип("ГруппаФормы"), ГруппаПлощадка);
			ГруппаРяд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаРяд.Заголовок = "Ряд: " + Ряд.Наименование;
			
			МестаОтбор = Новый Структура;
			МестаОтбор.Вставить("Площадка", Площадка);
			МестаОтбор.Вставить("Ряд", Ряд);
			МассивМест = ЭтотОбъект.ТаблицаМест.НайтиСтроки(МестаОтбор);
			Для каждого СтрокаМеста Из МассивМест Цикл
				Места = СтрокаМеста.Место;
				
				МестаИД = Строка(Места.УникальныйИдентификатор());
				МестаИД = СтрЗаменить(МестаИД, "-", "_");
				ИмяГруппыМеста = "ИмяГруппыМеста__" + МестаИД;
				ГруппаМесто = Элементы.Добавить(ИмяГруппыМеста, Тип("ГруппаФормы"), ГруппаРяд);
				ГруппаМесто.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				
				Если СтрокаМеста.Свободно Тогда
					ГруппаМесто.ЦветФона = Новый Цвет(0, 255, 127); // Зеленый - свободно
					ТекстАвто = "Свободно";
				Иначе
					ГруппаМесто.ЦветФона = Новый Цвет(255, 128, 114); // Красный - занято
					Если СтрокаМеста.ТранспортноеСредство = Неопределено Или СтрокаМеста.ТранспортноеСредство.Пустая() Тогда
						ТекстАвто = "Машина";
					Иначе
						ТекстАвто = СтрокаМеста.ТранспортноеСредство.Наименование;
					КонецЕсли;
				КонецЕсли;
				
				ИмяКнопки = "ИмяКнопки__" + МестаИД;
				НомерСтроки = Строка(СтрокаМеста.ПолучитьИдентификатор());
				КомандаМесто = Команды.Добавить("ИмяКнопки_" + НомерСтроки);
				КомандаМесто.Действие = "ОткрытьФормуМеста";
				КомандаМесто.Заголовок = ?(СтрокаМеста.Свободно,"Забронировать","Освободить");

				КнопкаМесто = Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), ГруппаМесто);
				КнопкаМесто.ИмяКоманды = КомандаМесто.Имя;
				КнопкаМесто.Ширина = 18;
				КнопкаМесто.Высота = 2;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМеста(Команда)
	
	ИмяМестаИД = Строка(СтрЗаменить(Команда.Имя,"ИмяКнопки_",""));
	//Индекс = СтрЗаменить(Команда.Имя,"КомандаМесто_","");
	СтрокаТаблициМест = ТаблицаМест.Получить(Число(ИмяМестаИД));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Площадка", СтрокаТаблициМест.Площадка);
	ПараметрыФормы.Вставить("Место", СтрокаТаблициМест.Место); 
	ПараметрыФормы.Вставить("Ряд", СтрокаТаблициМест.Ряд);
	
	Если СтрокаТаблициМест.Свободно Тогда
		ОткрытьФорму("Документ.ВъездНаПарковку.Форма.ФормаДокумента", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.ВыездСПарковки.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры 

 &НаКлиенте
Процедура ОткрытьФормуМеста1(Команда)
	
	Индекс = СтрЗаменить(Команда.Имя,"КомандаМесто_","");
	СтрокаТаблициМест = ТаблицаМест.Получить(Число(Индекс));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Площадка", СтрокаТаблициМест.Площадка);
	ПараметрыФормы.Вставить("Место", СтрокаТаблициМест.Место); 
	ПараметрыФормы.Вставить("Ряд", СтрокаТаблициМест.Ряд);
	
	Если СтрокаТаблициМест.Свободно Тогда
		ОткрытьФорму("Документ.ВъездНаПарковку.Форма.ФормаДокумента", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.ВыездСПарковки.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ВыборкаМест()

	ТаблицаМест.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Места.Ссылка КАК Место,
	|	Места.Наименование КАК НаименованиеМеста,
	|	Ряда.Ссылка КАК Ряд,
	|	Ряда.Наименование КАК НаименованиеРяда,
	|	Площадка1.Ссылка КАК Площадка,
	|	Площадка1.Наименование КАК НаименованиеПлощадки,
	|	ВЫБОР
	|		КОГДА ЗанятостьМестОстатки.СостояниеОстаток > 0
	|			ТОГДА 1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Свободно,
	|	ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка) КАК ТранспортноеСредство
	|ИЗ
	|	Справочник.Площадки КАК Площадка1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ряды КАК Ряда
	|		ПО Площадка1.Ссылка = Ряда.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Места КАК Места
	|		ПО Ряда.Ссылка = Места.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятостьМест.Остатки КАК ЗанятостьМестОстатки
	|		ПО ЗанятостьМестОстатки.Площадка = Площадка1.Ссылка
	|		И ЗанятостьМестОстатки.Территория = Площадка1.Владелец
	|		И ЗанятостьМестОстатки.Место = Места.Владелец
	|ГДЕ
	|	НЕ Ряда.ПометкаУдаления
	|	И НЕ Места.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Площадка,
	|	Ряд,
	|	Место
	|ИТОГИ
	|ПО
	|	Площадка,
	|	Ряд";
	
		
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыМест()
	
	ТаблицаМест.Очистить();
	
	ГруппаСетка = Элементы.Добавить("ГруппаСетка", Тип("ГруппаФормы"), Элементы.ГруппаМониторПарковки);
	ГруппаСетка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСетка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ВыборкаПлощадки = ВыборкаМест();
	
	Пока ВыборкаПлощадки.Следующий() Цикл
		ВыборкаРяды = ВыборкаПлощадки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ИмяПлощадки = СтрЗаменитьПоРегулярномуВыражению(ВыборкаПлощадки.НаименованиеПлощадки,"[^a-zA-Z0-9а-яА-ЯёЁ]","_");
		ГруппаПлощадка = Элементы.Добавить("ГруппаПлощадка_" + ИмяПлощадки, Тип("ГруппаФормы"), ГруппаСетка);
		ГруппаПлощадка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПлощадка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПлощадка.Заголовок = "Площадка: " + ВыборкаПлощадки.НаименованиеПлощадки;
		
		Пока ВыборкаРяды.Следующий() Цикл
			ВыборкаМеста = ВыборкаРяды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ИмяРяда = СтрЗаменитьПоРегулярномуВыражению(ВыборкаРяды.НаименованиеРяда,"[^a-zA-Z0-9а-яА-ЯёЁ]","_");
			ИмяГруппы = "ГруппаРяд_" + ИмяПлощадки + "_" + ИмяРяда;
			ГруппаРяд = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаПлощадка);
			ГруппаРяд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаРяд.Заголовок = "Ряд: " + ВыборкаРяды.НаименованиеПлощадки;
			
			Пока ВыборкаМеста.Следующий() Цикл
				Строка = ТаблицаМест.Добавить();
				ЗаполнитьЗначенияСвойств(Строка, ВыборкаМеста);
				Индекс = ТаблицаМест.Индекс(Строка);
				
				ГруппаМесто = Элементы.Добавить("Место_" + Индекс, Тип("ГруппаФормы"), ГруппаРяд);
				ГруппаМесто.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				
				Если Строка.Свободно Тогда
					ГруппаМесто.ЦветФона = Новый Цвет(0, 255, 127); // Зеленый - свободно
					ТекстАвто = "Свободно";
				Иначе
					ГруппаМесто.ЦветФона = Новый Цвет(255, 128, 114); // Красный - занято
					Если Строка.ТранспортноеСредство = Неопределено Или Строка.ТранспортноеСредство.Пустая() Тогда
						ТекстАвто = "Машина";
					Иначе
						ТекстАвто = Строка.ТранспортноеСредство.Наименование;
					КонецЕсли;
				КонецЕсли;

				КомандаМесто = Команды.Добавить("КомандаМесто_" + Индекс);
				КомандаМесто.Действие = "ОткрытьФормуМеста";
				КомандаМесто.Заголовок = ?(Строка.Свободно,"Забронировать","Освободить");

				КнопкаМесто = Элементы.Добавить("КнопкаЯчейка_" + Индекс, Тип("КнопкаФормы"), ГруппаМесто);
				КнопкаМесто.ИмяКоманды = КомандаМесто.Имя;
				КнопкаМесто.Ширина = 18;
				КнопкаМесто.Высота = 2;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;    
КонецПроцедуры




#КонецОбласти

