#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Инициализация при создании формы
	ОбновитьМеста();

КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТаблицуМест(Команда)
	ОбновитьМеста();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьМеста()
	
	ОбновитьЭлементыМест();
	
КонецПроцедуры

&НаСервере
Функция ВыборкаМест()

	ТаблицаМест.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Места.Ссылка КАК Место,
	|	Места.Наименование КАК НаименованиеМеста,
	|	Ряда.Ссылка КАК Ряд,
	|	Ряда.Наименование КАК НаименованиеРяда,
	|	Площадка1.Ссылка КАК Площадка,
	|	Площадка1.Наименование КАК НаименованиеПлощадки,
	|	Ложь КАК Свободно,
	|	ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка) КАК ТранспортноеСредство
	|ИЗ
	|	Справочник.Площадка КАК Площадка1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ряда КАК Ряда
	|		ПО Площадка1.Ссылка = Ряда.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Места КАК Места
	|		ПО (Ряда.Ссылка = Места.Владелец)
	|ГДЕ
	|	НЕ Ряда.ПометкаУдаления
	|	И НЕ Места.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Площадка,
	|	Ряд,
	|	Место
	|ИТОГИ ПО
	|	Площадка,
	|	Ряд";
	
		
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыМест()
	
	ТаблицаМест.Очистить();
	
	ГруппаСетка = Элементы.Добавить("ГруппаСетка", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаСетка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСетка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ВыборкаПлощадки = ВыборкаМест();
	
	Пока ВыборкаПлощадки.Следующий() Цикл
		ВыборкаРяды = ВыборкаПлощадки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ИмяПлощадки = СтрЗаменитьПоРегулярномуВыражению(ВыборкаПлощадки.НаименованиеПлощадки,"[^a-zA-Z0-9а-яА-ЯёЁ]","_");
		ГруппаПлощадка = Элементы.Добавить("ГруппаПлощадка_" + ИмяПлощадки, Тип("ГруппаФормы"), ГруппаСетка);
		ГруппаПлощадка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПлощадка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПлощадка.Заголовок = "Площадка: " + ВыборкаПлощадки.НаименованиеПлощадки;
		
		Пока ВыборкаРяды.Следующий() Цикл
			ВыборкаМеста = ВыборкаРяды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ИмяРяда = СтрЗаменитьПоРегулярномуВыражению(ВыборкаРяды.НаименованиеРяда,"[^a-zA-Z0-9а-яА-ЯёЁ]","_");
			ИмяГруппы = "ГруппаРяд_" + ИмяПлощадки + "_" + ИмяРяда;
			ГруппаРяд = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаПлощадка);
			ГруппаРяд.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРяд.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
			ГруппаРяд.Заголовок = "Ряд: " + ВыборкаРяды.НаименованиеПлощадки;
			
			Пока ВыборкаМеста.Следующий() Цикл
				Строка = ТаблицаМест.Добавить();
				ЗаполнитьЗначенияСвойств(Строка, ВыборкаМеста);
				Индекс = ТаблицаМест.Индекс(Строка);
				
				ГруппаМесто = Элементы.Добавить("Место_" + Индекс, Тип("ГруппаФормы"), ГруппаРяд);
				ГруппаМесто.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				
				
				Если Строка.Свободно Тогда
					ГруппаМесто.ЦветФона = Новый Цвет(0, 255, 127); // Зеленый - свободно
					ТекстАвто = "Свободно";
				Иначе
					ГруппаМесто.ЦветФона = Новый Цвет(255, 128, 114); // Красный - занято
					Если Строка.ТранспортноеСредство = Неопределено Или Строка.ТранспортноеСредство.Пустая() Тогда
						ТекстАвто = "Машина";
					Иначе
						ТекстАвто = Строка.ТранспортноеСредство.Наименование;
					КонецЕсли;
				КонецЕсли;

				КомандаМесто = Команды.Добавить("КомандаМесто_" + Индекс);
				КомандаМесто.Действие = "ОткрытьФормуМеста";
				КомандаМесто.Заголовок = ?(Строка.Свободно,"Забронировать","Освободить");

				КнопкаМесто = Элементы.Добавить("КнопкаЯчейка_" + Индекс, Тип("КнопкаФормы"), ГруппаМесто);
				КнопкаМесто.ИмяКоманды = КомандаМесто.Имя;
				КнопкаМесто.Ширина = 18;
				КнопкаМесто.Высота = 2;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМеста(Команда)
	
	Индекс = СтрЗаменить(Команда.Имя,"КомандаМесто_","");
	СтрокаТаблициМест = ТаблицаМест.Получить(Число(Индекс));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Площадка", СтрокаТаблициМест.Площадка);
	ПараметрыФормы.Вставить("Место", СтрокаТаблициМест.Место); 
	ПараметрыФормы.Вставить("Ряд", СтрокаТаблициМест.Ряд);
	
	Если СтрокаТаблициМест.Свободно Тогда
		ОткрытьФорму("Документ.ВъездНаПарковку.Форма.ФормаДокумента", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.ВыездСПарковки.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры 


#КонецОбласти

